In [1]:
import pandas
pandas.__version__

'1.5.3'

In [2]:
import numpy as np
import pandas as pd

In [3]:
counts = pd.Series([632, 1638, 569, 115])
counts

0     632
1    1638
2     569
3     115
dtype: int64

In [4]:
counts.values

array([ 632, 1638,  569,  115], dtype=int64)

In [5]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
bacteria = pd.Series([632, 1638, 569, 115],
   index=['Firnicutes', 'Proteobacteria','Actinobacteria', 'Bacteroidetes'])
    
bacteria

Firnicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteroidetes      115
dtype: int64

In [7]:
bacteria['Actinobacteria']

569

In [8]:
bacteria[0]

632

In [9]:
bacteria.name = 'counts'
bacteria.index.name = 'phylum'
bacteria

phylum
Firnicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteroidetes      115
Name: counts, dtype: int64

In [10]:
np.log(bacteria)

phylum
Firnicutes        6.448889
Proteobacteria    7.401231
Actinobacteria    6.343880
Bacteroidetes     4.744932
Name: counts, dtype: float64

In [11]:
bacteria[bacteria>500]

phylum
Firnicutes         632
Proteobacteria    1638
Actinobacteria     569
Name: counts, dtype: int64

In [12]:
mon_dict = {'Sept': 2000, 'Aug': 1999, 'May': 2003, 'july': 1990}
print(mon_dict)
pd.Series(mon_dict)

{'Sept': 2000, 'Aug': 1999, 'May': 2003, 'july': 1990}

Sept    2000
Aug     1999
May     2003
july    1990
dtype: int64

In [13]:
data = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "Literacy": [0.2, 0.1, 0.5, 0.3, 0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [14]:
df = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])
df

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

In [15]:
df['nonsense'] = df.Year / df.Literacy
df

   Year Province  Literacy      nonsense
0  2013       FL       0.2  10065.000000
1  2014       FL       0.1  20140.000000
2  2013       NH       0.5   4026.000000
3  2014       NH       0.3   6713.333333
4  2014       ZH       0.5   4028.000000

In [16]:
df['Series_aligned'] = pd.Series(range(5), index=[0,1,2,3,4])
df

   Year Province  Literacy      nonsense  Series_aligned
0  2013       FL       0.2  10065.000000               0
1  2014       FL       0.1  20140.000000               1
2  2013       NH       0.5   4026.000000               2
3  2014       NH       0.3   6713.333333               3
4  2014       ZH       0.5   4028.000000               4

In [17]:
df.to_dict()

{'Year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014},
 'Province': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'nonsense': {0: 10065.0,
  1: 20140.0,
  2: 4026.0,
  3: 6713.333333333334,
  4: 4028.0},
 'Series_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [18]:
pd.DataFrame(df.to_dict())

   Year Province  Literacy      nonsense  Series_aligned
0  2013       FL       0.2  10065.000000               0
1  2014       FL       0.1  20140.000000               1
2  2013       NH       0.5   4026.000000               2
3  2014       NH       0.3   6713.333333               3
4  2014       ZH       0.5   4028.000000               4

In [19]:
data = [{'a': i, 'b':10* i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [20]:
 pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [21]:
pd.DataFrame(np.random.randint(2,12),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

   foo  bar
a    9    9
b    9    9
c    9    9

In [22]:
ind = pd.Index([20, 34, 57, 7, 1, 8 ])
ind

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [23]:
ind[1]

34

In [24]:
ind[5]

8

In [25]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

6 (6,) 1 int64

In [26]:
ind[1] = 0

TypeError: Index does not support mutable operations

In [27]:
rng = np.random.RandomState(10)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    9
1    4
2    0
3    1
dtype: int32

In [28]:
dfr = pd.DataFrame(rng.randint(0, 10, (5, 4)),
                   columns=['A', 'B', 'C', 'D'])
dfr

   A  B  C  D
0  9  0  1  8
1  9  0  8  6
2  4  3  0  4
3  6  8  1  8
4  4  1  3  6

In [29]:
np.exp(ser)

0    8103.083928
1      54.598150
2       1.000000
3       2.718282
dtype: float64

In [30]:
np.sin(dfr * np.p1 / 4)

AttributeError: module 'numpy' has no attribute 'p1'

In [31]:
area = pd.Series({'Alaska':1723337, 'Texas':695662, 'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
print(area)
population

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [32]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [33]:
area.index | population.index

C:\Users\swetha\AppData\Local\Temp\ipykernel_31416\3572280633.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [34]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 2, 3], index=[1, 2, 3])
print(A)
print(B)
B
A + B

0    2
1    4
2    6
dtype: int64
1    1
2    2
3    3
dtype: int64

0    NaN
1    5.0
2    8.0
3    NaN
dtype: float64

In [35]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    8.0
3    3.0
dtype: float64

In [36]:
df

   Year Province  Literacy      nonsense  Series_aligned
0  2013       FL       0.2  10065.000000               0
1  2014       FL       0.1  20140.000000               1
2  2013       NH       0.5   4026.000000               2
3  2014       NH       0.3   6713.333333               3
4  2014       ZH       0.5   4028.000000               4

In [37]:
df2 = pd.DataFrame({"Province": ["FL", "NH", "ZH"], "population": ["100000", "200000", "300000"]})
df2

  Province population
0       FL     100000
1       NH     200000
2       ZH     300000

In [38]:
df.merge(df2)

   Year Province  Literacy      nonsense  Series_aligned population
0  2013       FL       0.2  10065.000000               0     100000
1  2014       FL       0.1  20140.000000               1     100000
2  2013       NH       0.5   4026.000000               2     200000
3  2014       NH       0.3   6713.333333               3     200000
4  2014       ZH       0.5   4028.000000               4     300000

In [39]:
df3 = pd.DataFrame({"Province": ["FL", "NH"], "Population": ["100000", "200000",]})
df3
df.merge(df3, right_on='Province', left_on='Province')

   Year Province  Literacy      nonsense  Series_aligned Population
0  2013       FL       0.2  10065.000000               0     100000
1  2014       FL       0.1  20140.000000               1     100000
2  2013       NH       0.5   4026.000000               2     200000
3  2014       NH       0.3   6713.333333               3     200000

In [40]:
df4 = pd.DataFrame({"Province": ["FL", "NH", "UL"], "Population": ["100000", "200000", "500000"]})
df.merge(df4, how='outer')

     Year Province  Literacy      nonsense  Series_aligned Population
0  2013.0       FL       0.2  10065.000000             0.0     100000
1  2014.0       FL       0.1  20140.000000             1.0     100000
2  2013.0       NH       0.5   4026.000000             2.0     200000
3  2014.0       NH       0.3   6713.333333             3.0     200000
4  2014.0       ZH       0.5   4028.000000             4.0        NaN
5     NaN       UL       NaN           NaN             NaN     500000

In [41]:
df5 = pd.DataFrame({"Province": ["FL", "NH", "UL"], "Population": ["100000", "200000", "500000"]})
print(df)
df.merge(df5, how='outer')

   Year Province  Literacy      nonsense  Series_aligned
0  2013       FL       0.2  10065.000000               0
1  2014       FL       0.1  20140.000000               1
2  2013       NH       0.5   4026.000000               2
3  2014       NH       0.3   6713.333333               3
4  2014       ZH       0.5   4028.000000               4

     Year Province  Literacy      nonsense  Series_aligned Population
0  2013.0       FL       0.2  10065.000000             0.0     100000
1  2014.0       FL       0.1  20140.000000             1.0     100000
2  2013.0       NH       0.5   4026.000000             2.0     200000
3  2014.0       NH       0.3   6713.333333             3.0     200000
4  2014.0       ZH       0.5   4028.000000             4.0        NaN
5     NaN       UL       NaN           NaN             NaN     500000

In [42]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], 
                     index=['f', 'e', 'd', 'c', 'b', 'a'])

serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64), 
                index=['f', 'e', 'd', 'c', 'b', 'a'])

In [43]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [44]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [45]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [46]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64